#include "Delay.h"

volatile u8 fac_us=0; //us延时倍乘数 
/***********************************************************************************************************
* 函数名称: Delay_Init()
* 输入参数: clk 时钟频率为多少M （24/16/12/8等）
* 返回值  : 无
* 功    能: 软件延时初始化
************************************************************************************************************/
void Delay_Init(u8 clk)
{
  if(clk>16)
    fac_us=(16-4)/4;//24Mhz时,stm8大概19个周期为1us
  else if(clk>4)
    fac_us=(clk-4)/4; 
  else 
    fac_us=1;
}



/***********************************************************************************************************
* 函数名称: Delay_us()
* 输入参数: nus ,延时的微秒数
* 返回值  : 无
* 功    能: 微秒级延时函数
************************************************************************************************************/
void Delay_us(u16 nus)
{
  __asm(
  "PUSH A          \n"  //1T,压栈
  "DELAY_XUS:      \n"   
  "LD A,fac_us     \n"   //1T,fac_us加载到累加器A
  "DELAY_US_1:     \n"  
  "NOP             \n"  //1T,nop延时
  "DEC A           \n"  //1T,A--
  "JRNE DELAY_US_1 \n"   //不等于0,则跳转(2T)到DELAY_US_1继续执行,若等于0,则不跳转(1T).
  "NOP             \n"  //1T,nop延时
  "DECW X          \n"  //1T,x--
  "JRNE DELAY_XUS  \n"    //不等于0,则跳转(2T)到DELAY_XUS继续执行,若等于0,则不跳转(1T).
  "POP A           \n"  //1T,出栈
  );
}


/***********************************************************************************************************
* 函数名称: Delay_ms()
* 输入参数: nms， 延时的毫秒数
* 返回值  : 无
* 功    能: 毫秒级延时函数，nms不要大于16640
************************************************************************************************************/
void Delay_ms(u16 nms)
{
  u8 t;
  if(nms>65)
  {
    t=nms/65;
    while(t--)Delay_us(65000);
    nms=nms%65;
  }
  Delay_us(nms*1000);
}


