#include "LSM6DSL.h"
#include "Delay.h"
#include "lsm6dsl_reg.h"
#include "Main.h"

/***********************************************************************************************************
* 函数名称: IIC_Init()
* 输入参数: 无
* 返回值  : 无
* 功    能: 初始化IIC引脚
************************************************************************************************************/
void IIC2_Init(void)
{
  GPIO_Init(GPIOC,GPIO_PIN_5,GPIO_MODE_OUT_OD_HIZ_FAST ); //SDA
  GPIO_Init(GPIOG,GPIO_PIN_0,GPIO_MODE_OUT_OD_HIZ_FAST ); //SCL
  
  SCL1_H;
  Delay_us(4);
  SDA1_H;
}

/***********************************************************************************************************
* 函数名称: IIC_Start()
* 输入参数: 无
* 返回值  : 无
* 功    能: IIC起始条件
************************************************************************************************************/
void IIC2_Start(void)
{
  SDA1_H;
  SCL1_H; 
  Delay_us(4);
  SDA1_L;
  Delay_us(4);
  SCL1_L;
}

/***********************************************************************************************************
* 函数名称: IIC_Stop()
* 输入参数: 无
* 返回值  : 无
* 功    能: IIC停止条件
************************************************************************************************************/
void IIC2_Stop(void)
{ 
  SCL1_L;
  SDA1_L;
  Delay_us(4);
  SCL1_H;
  Delay_us(4);
  SDA1_H;
}

/***********************************************************************************************************
* 函数名称: IIC_WaiteAck()
* 输入参数: 无
* 返回值  : 无
* 功    能: 等待ACK应答
************************************************************************************************************/
u8 IIC2_WaiteAck(void)
{
  u16 i = 0;
  
  SDA1_H;
  Delay_us(2);
  SCL1_H;
  Delay_us(2);
  while(ReadSDA1)
  {
    i++;
    if(i > 5000)
    {
      IIC2_Stop();
      return 0;
    }
  }
  SCL1_L;
  return 1;  
}

/***********************************************************************************************************
* 函数名称: IIC_SendAck()
* 输入参数: 无
* 返回值  : 无
* 功    能: 向IIC器件发送ACK信号
************************************************************************************************************/
void IIC2_SendAck(void)
{
  SCL1_L;
  SDA1_L;;
  Delay_us(2);
  SCL1_H;
  Delay_us(2);
  SCL1_L;
  SDA1_H; //必须释放SDA总线
}

/***********************************************************************************************************
* 函数名称: IIC_SendNoAck()
* 输入参数: 无
* 返回值  : 无
* 功    能: 向IIC器件发送NoAck信号
************************************************************************************************************/
void IIC2_SendNoAck(void)
{
  SCL1_L;
  SDA1_H;
  Delay_us(2);
  SCL1_H;
  Delay_us(2);
  SCL1_L;
  SDA1_H; //必须释放SDA总线 
}

/***********************************************************************************************************
* 函数名称: IIC_WriteByte()
* 输入参数: data, 要写入的字节数据
* 返回值  : 无
* 功    能: 向IIC器件写入一字节数据
************************************************************************************************************/
void IIC2_WriteByte(u8 data)
{
  u8 i;
  
  SCL1_L;
  for(i = 0; i < 8; i++)
  {
    if((data&0x80))
    {
      SDA1_H;
    }
    else
    {
      SDA1_L;
    }
    Delay_us(2);
    SCL1_H;
    Delay_us(2);
    SCL1_L;
    Delay_us(2);
    data = (data<<1);
  }
}

/***********************************************************************************************************
* 函数名称: IIC_ReadByte()
* 输入参数: ack, ack>0，则发送ACK应答， 否则发送NoAck应答
* 返回值  : 一个字节的数据
* 功    能: 从IIC器件中读取一字节的数据
************************************************************************************************************/
u8 IIC2_ReadByte(u8 ack)
{
  u8 i= 0,data = 0;
  
  for(i = 0; i < 8; i++)
  {
    SCL1_L;
    Delay_us(2);
    SCL1_H;
    data = (data<<1);
    if(ReadSDA1)
    {
      data |= 0x01;
    }
    Delay_us(2);
  }
  if(ack)
    IIC2_SendAck();
  else
    IIC2_SendNoAck();
  return data;
}


